app/views/interpolations/index.html.erb

			<ul>
			<% current_user.interpolations.each do |i| %>
---
SELECT "interpolations".* FROM "interpolations" WHERE "interpolations"."user_id" = 1