app/views/interpolations/show.html.erb


<% @interpolation.changes.each do |change| %>
---
SELECT "changes".* FROM "changes" WHERE "changes"."interpolation_id" = 1


<% @interpolation.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."interpolation_id" = 1