app/views/users/show.html.erb

<b>Created:</b>
<% @user.interpolations.each do |i| %>
---
SELECT "interpolations".* FROM "interpolations" WHERE "interpolations"."user_id" = 1

<b>Downloads:</b>
<% @user.downloads.each do |d| %>
---
SELECT "downloads".* FROM "downloads" WHERE "downloads"."user_id" = 1