app/controllers/interpolations_controller.rb

SELECT "interpolations".* FROM "interpolations" ORDER BY created_at desc
---
  def index
    @interpolations = Interpolation.all

SELECT "interpolations".* FROM "interpolations" WHERE "interpolations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @interpolation = Interpolation.find(params[:id])

INSERT INTO "interpolations" ("comments_count", "created_at", "downloads_count", "name", "private", "rating_average", "ratings_count", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @interpolation = Interpolation.new(params[:interpolation])

    @interpolation.user_id = current_user.id

    respond_to do |format|
      if @interpolation.save

SELECT "interpolations".* FROM "interpolations" WHERE "interpolations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def rate
    @interpolation = Interpolation.find(params[:id])